# -*- coding: utf-8 -*-

'''
Напишите функцию, которая будет принимать список списков
и возвращать новый список списков, содержащий все
элементы старого за исключением внешних.

Примечания:
- 2D-сетка всегда имеет форму прямоугольника или квадрата.
- Возвращать нужно именно список списков, за
исключением ситуации, когда элементов просто нет.
В таком случае нужно вернуть пустой список.

Примеры:
peel_layer_off([
  ["a", "b", "c", "d"],
  ["e", "f", "g", "h"],
  ["i", "j", "k", "l"],
  ["m", "n", "o", "p"]
]) -> [
  ["f", "g"],
  ["j", "k"]
]

peel_layer_off([
  [1, 2, 3, 4, 5],
  [6, 7, 8, 9, 10],
  [11, 12, 13, 14, 15],
  [16, 17, 18, 19, 20],
  [21, 22, 23, 24, 25],
  [26, 27, 28, 29, 30],
  [31, 32, 33, 34, 35]
]) -> [
  [7, 8, 9],
  [12, 13, 14],
  [17, 18, 19],
  [22, 23, 24],
  [27, 28, 29]
]

peel_layer_off([
  [True, False, True],
  [False, False, True],
  [True, True, True]
]) -> [[False]]

peel_layer_off([
  ["hello", "world"],
  ["hello", "world"]
]) -> []
'''

from typing import List, Any

def peel_layer_off(arr: List[List[Any]]) -> List[List[Any]]:
    '''
    Из списка списков составляет список списков не включая
    крайние элементы.
    '''
    return [line[1:-1] for line in arr[1:-1]]



tests = (([["a", "b", "c", "d"],
           ["e", "f", "g", "h"],
           ["i", "j", "k", "l"],
           ["m", "n", "o", "p"]], [["f", "g"],
                                   ["j", "k"]]),
         ([[1, 2, 3, 4, 5],
           [6, 7, 8, 9, 10],
           [11, 12, 13, 14, 15],
           [16, 17, 18, 19, 20],
           [21, 22, 23, 24, 25],
           [26, 27, 28, 29, 30],
           [31, 32, 33, 34, 35]], [[7, 8, 9],
                                   [12, 13, 14],
                                   [17, 18, 19],
                                   [22, 23, 24],
                                   [27, 28, 29]]),
         ([[True, False, True],
           [False, False, True],
           [True, True, True]], [[False]]),

         ([["hello", "world"],
           ["hello", "world"]], []))

for arr, check in tests:
    print(peel_layer_off(arr=arr) == check)

