# -*- coding: utf-8 -*-

'''
Необходимо написать функцию, которая будет принимать два массива.
Её задача — отсортировать элементы из первого массива, в
зависимости от их повторяемости в втором.

sort_by_count([1, 2, 3], [1, 1, ,1, 1, 2, 3, 3, 3]) [1, 3, 2]
sort_by_count(["b", 0, 3], ["a", 0, 1, 1, 3, 1, 3]) [3, 0, "b"]
sort_by_count([None, 0, 1], ["a", 0, 1, 1, 3, 1, 3]) [1, 0, None]
'''

def sort_by_count(arr1: list, arr2: list) -> list:
    '''
    Возврат отсортированного списка, по убыванию, arr1 по количеству
    вхождений элементов в списке arr2.
    '''
    return sorted(arr1, key=arr2.count, reverse=True)



tests = ((([1, 2, 3], [1, 1, 1, 1, 2, 3, 3, 3]), [1, 3, 2]),
         ((["b", 0, 3], ["a", 0, 1, 1, 3, 1, 3]), [3, 0, "b"]),
         (([None, 0, 1], ["a", 0, 1, 1, 3, 1, 3]), [1, 0, None]))

for args, check in tests:
    print(sort_by_count(*args) == check)

